// Задача 24: Найти кубы чисел от 1 до N
int A = 1;
 Console.WriteLine("Введите число до которого нужно узнать кубы");
int B = int.Parse(Console.ReadLine());
for ( A=1; A<=  B; A++)
    Console.WriteLine(A+"^3 = "+A*A*A);


